---
kind: other
id: Properties.T:Autodesk.Revit.DB.LinkElementId
source: html/4aa2b2e7-bad3-efc0-07dd-5273c4f8e883.htm
---
# LinkElementId Properties

The id of the element in the host, or invalidElementId if there is a link.